import {loadData} from '../src/services/csv'

test('Empty file', () => {
  expect(loadData('')).toBe(false)
})

test('Empty with sep', () => {
  expect(loadData('sep=,\n')).toStrictEqual({
    accounts: undefined,
    expenses: undefined,
    incomes: undefined,
    operations: [],
    tags: undefined,
  })
})

const inp1 = `sep=,
"Данные","Тип","Из","В","Метки","Сумма","Валюта","Сумма в др.валюте","Др.валюта","Повторение","Заметка"
"3/1/2019","Расход","Сбер Тош","Кафешки","Грабли","287","RUB","287","RUB","Нет",""
"3/1/2019","Расход","Нал Таня","Кафешки","Якитория","1500","RUB","1500","RUB","Нет",""
"3/1/2019","Перевод","Украшения","Сбер Таня","","2300","RUB","2300","RUB","Нет",""
"3/1/2019","Перевод","Украшения","Сбер Таня","","5900","RUB","5900","RUB","Нет",""`
test('Some ops, date with /', () => {
  let {operations} = loadData(inp1)
  expect(operations.length).toBe(4)
})

const inp2 = `sep=,
"Данные","Тип","Из","В","Метки","Сумма","Валюта","Сумма в др.валюте","Др.валюта","Повторение","Заметка"
"03.01.2019","Расход","Сбер Тош","Кафешки","Грабли","287","RUB","287","RUB","Нет",""
"03.01.2019","Расход","Нал Таня","Кафешки","Якитория","1500","RUB","1500","RUB","Нет",""
"03.01.2019","Перевод","Украшения","Сбер Таня","","2300","RUB","2300","RUB","Нет",""
"03.01.2019","Перевод","Украшения","Сбер Таня","","5900","RUB","5900","RUB","Нет",""`
test('Some ops, date with .', () => {
  let {operations} = loadData(inp1)
  expect(operations.length).toBe(4)
})
